src/Tasks/Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>Задача</Name>
			<Addressing>InformationRegister.ИсполнителиРолей</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцесса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Роли</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

src/Tasks/Задача/Ext/ManagerModule.bsl
Процедура ПринятьКИсполнению(Задача) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
		|	Задача.Выполнена КАК Выполнена,
		|	Задача.Исполнитель КАК Исполнитель,
		|	Задача.Роль КАК Роль
		|ИЗ
		|	Задача.Задача КАК Задача
		|ГДЕ
		|	Задача.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Сообщить("Не выбрана задача, принятие невозможно");
		Возврат;
	КонецЕсли;
	
	Исполнитель = Выборка.Исполнитель;
	
	Если Исполнитель = ПараметрыСеанса.СотрудникТекущегоПользователя Тогда
		
		Сообщить("Задача уже принята к исполнению вами");
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Исполнитель) Тогда
		
		Сообщить("Задача уже принята к исполнению другим сотрудником");
		Возврат;
		
	КонецЕсли;
	
	Задача = Задача.ПолучитьОбъект();
	Задача.Исполнитель = ПараметрыСеанса.СотрудникТекущегоПользователя;
	Задача.Записать();

КонецПроцедуры
